app/controllers/answers_controller.rb

INSERT INTO "answers" ("created_at", "decision_id", "text", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 25 Sep 2014 01:15:31 UTC +00:00], ["decision_id", 13], ["text", "Yale"], ["updated_at", Thu, 25 Sep 2014 01:15:31 UTC +00:00]]
---
    def create
      #find our parent decision that we should attach to?
      @answer = Answer.new(
        params.require(:answer).permit(:rating, :text))

      #attaches this answer to a decision.

      @answer.decision = @decision
      if @answer.save