app/controllers/criteria_answers_controller.rb

  def new

    @decision = Decision.find(params[:id])
    # passed_id = params(:id)
    # decision = decisions.where(:id = passed_id)

    @decision.answers.each do |a|
      @decision.criteria.each do |c|
        onerec = CriteriaAnswer.new
        onerec.decision_id  = a.id
        onerec.criterion_id = c.id
        onerec.rating       = 0
        onerec.save
---
SELECT "decisions".* FROM "decisions" WHERE "decisions"."id" = $1 LIMIT 1  [["id", "12"]]
SELECT "answers".* FROM "answers" WHERE "answers"."decision_id" = $1  [["decision_id", 12]]
SELECT "criteria".* FROM "criteria" WHERE "criteria"."decision_id" = $1  [["decision_id", 12]]
INSERT INTO "criteria_answers" ("created_at", "criterion_id", "decision_id", "rating", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Thu, 25 Sep 2014 01:13:57 UTC +00:00], ["criterion_id", 20], ["decision_id", 44], ["rating", 0], ["updated_at", Thu, 25 Sep 2014 01:13:57 UTC +00:00]]

  def edit
      @decision = Decision.find(params[:id])
---
SELECT "decisions".* FROM "decisions" WHERE "decisions"."id" = $1 LIMIT 1  [["id", "12"]]