app/controllers/decisions_controller.rb

INSERT INTO "decisions" ("text", "user_id") VALUES ($1, $2) RETURNING "id"  [["text", "Where do I go to school?"], ["user_id", 3]]
---
	def create
	if !current_user
	  redirect_to home_path
	  return
	end
	decision = current_user.decisions.new(
			params.require(:decision).permit(:text)
			)
	# with this decision object, attach it to the user.
	decision.user = current_user
		if decision.save

SELECT "decisions".* FROM "decisions" WHERE "decisions"."id" = $1 LIMIT 1  [["id", "12"]]
---
	def show

		@decision = Decision.find(params[:id])

SELECT "decisions".* FROM "decisions" WHERE "decisions"."id" = 12 ORDER BY "decisions"."id" ASC LIMIT 1
---
	def update
		#saves rating to criteria for each answer
    decision = Decision.where(id: params[:id]).first

DELETE FROM "decisions" WHERE "decisions"."id" = $1  [["id", 15]]
SELECT "decisions".* FROM "decisions" WHERE "decisions"."id" = $1 LIMIT 1  [["id", "15"]]
SELECT COUNT(*) FROM "decisions"
---
	def destroy
		#deletes a decision
		Decision.find(params[:id]).destroy
		if Decision.count < 1