app/controllers/sessions_controller.rb

	def create
		# brings us into our session/stores the thought of loggin in/places cookies/only local machine knows its logged in.

		 #find the user that is trying to log in.

		u = User.where(email: params[:user][:email]).first
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'jack@aol.com' ORDER BY "users"."id" ASC LIMIT 1